## Plan Result (demo_frontdoor - TerraformPlanApply)




<pre><code>Plan: 28 to add, 15 to change, 0 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;portal-demo&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;portal-demo&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;vh-video-web&#34;]
* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;portal-demo&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["c100-application"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/ruleSets/c100applicationcaching",
        ] -> (known after apply)
        id                              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/afdEndpoints/sdshmcts-demo/routes/c100-application"
        name                            = "c100-application"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["darts-portal"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/afdEndpoints/sdshmcts-demo/routes/darts-portal"
        name                            = "darts-portal"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["juror-bureau"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/afdEndpoints/sdshmcts-demo/routes/juror-bureau"
        name                            = "juror-bureau"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["juror-public"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/afdEndpoints/sdshmcts-demo/routes/juror-public"
        name                            = "juror-public"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["pip-frontend"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/ruleSets/pipfrontendcaching",
        ] -> (known after apply)
        id                              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/afdEndpoints/sdshmcts-demo/routes/pip-frontend"
        name                            = "pip-frontend"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["pip-frontend-b2c-sign-in"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/afdEndpoints/sdshmcts-demo/routes/pip-frontend-b2c-sign-in"
        name                            = "pip-frontend-b2c-sign-in"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["pip-frontend-b2c-staff"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/afdEndpoints/sdshmcts-demo/routes/pip-frontend-b2c-staff"
        name                            = "pip-frontend-b2c-staff"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["portal-demo"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/afdEndpoints/sdshmcts-demo/routes/portal-demo"
        name                            = "portal-demo"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["pre-portal"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/afdEndpoints/sdshmcts-demo/routes/pre-portal"
        name                            = "pre-portal"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["sds-api-mgmt"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/afdEndpoints/sdshmcts-demo/routes/sds-api-mgmt"
        name                            = "sds-api-mgmt"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["toffee"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/ruleSets/toffeecaching",
        ] -> (known after apply)
        id                              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/afdEndpoints/sdshmcts-demo/routes/toffee"
        name                            = "toffee"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["vh-admin-web"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/afdEndpoints/sdshmcts-demo/routes/vh-admin-web"
        name                            = "vh-admin-web"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["vh-test-web"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/afdEndpoints/sdshmcts-demo/routes/vh-test-web"
        name                            = "vh-test-web"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["vh-video-web"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/afdEndpoints/sdshmcts-demo/routes/vh-video-web"
        name                            = "vh-video-web"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["c100-application"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "c100applicationHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["darts-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "dartsportalHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["juror-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "jurorbureauHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "jurorpublicHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["pip-frontend"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "pipfrontendHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["pip-frontend-b2c-sign-in"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "pipfrontendb2csigninHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["pip-frontend-b2c-staff"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "pipfrontendb2cstaffHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["portal-demo"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "portaldemoHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["pre-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "preportalHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["sds-api-mgmt"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "sdsapimgmtHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["toffee"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "toffeeHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["vh-admin-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "vhadminwebHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["vh-test-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "vhtestwebHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["vh-video-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "vhvideowebHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["c100-application"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
      + id                       = (known after apply)
      + name                     = "c100applicationHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["darts-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
      + id                       = (known after apply)
      + name                     = "dartsportalHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["juror-bureau"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
      + id                       = (known after apply)
      + name                     = "jurorbureauHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
      + id                       = (known after apply)
      + name                     = "jurorpublicHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["pip-frontend"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
      + id                       = (known after apply)
      + name                     = "pipfrontendHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["pip-frontend-b2c-sign-in"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
      + id                       = (known after apply)
      + name                     = "pipfrontendb2csigninHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["pip-frontend-b2c-staff"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
      + id                       = (known after apply)
      + name                     = "pipfrontendb2cstaffHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["portal-demo"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
      + id                       = (known after apply)
      + name                     = "portaldemoHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["pre-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
      + id                       = (known after apply)
      + name                     = "preportalHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["sds-api-mgmt"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
      + id                       = (known after apply)
      + name                     = "sdsapimgmtHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["toffee"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
      + id                       = (known after apply)
      + name                     = "toffeeHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["vh-admin-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
      + id                       = (known after apply)
      + name                     = "vhadminwebHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["vh-test-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
      + id                       = (known after apply)
      + name                     = "vhtestwebHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["vh-video-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
      + id                       = (known after apply)
      + name                     = "vhvideowebHstsRule"
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo|fd-log-analytics-logs-sa"
        name                           = "fd-log-analytics-logs-sa"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 28 to add, 15 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":918,"Program":"tfcmt","SHA1":"","Target":"demo_frontdoor - TerraformPlanApply","Vars":{}} -->